Tekla Open API Reference for Tekla Structures 2025
PluginAttribute Class
 The PluginAttribute class is used for storing the name of the plug-in to the system. The attribute is initialized from the custom attribute [Plugin("PluginName")] in the plug-in source.
Inheritance Hierarchy
System.Object
 System.Attribute
 Tekla.Structures.Plugins.PluginAttribute
 Namespace: Tekla.Structures.Plugins
 Assembly: Tekla.Structures.Plugins (in Tekla.Structures.Plugins.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class PluginAttribute : Attribute
Public NotInheritable Class PluginAttribute
	Inherits Attribute
The PluginAttribute type exposes the following members.
Constructors
Name | Description
PluginAttribute
 The custom attribute [Plugin("PluginName")] uses this to store the name to the system. This is not to be used by itself.
Top
Properties
Name | Description
Name
 The name of the plug-in in the system.
Top
See Also
Reference
Tekla.Structures.Plugins Namespace